def startup() : #실행 시 첫화면
    print("===================================")
    print("JJ Daily - SW기초설계 6조 과제")
    print("대학생활에 도움되는 기능을 한번에!")
    print("===================================")

def shutdown() : #실행 시 첫화면
    print("\n")
    print("===================================")
    print("이용해 주셔서 감사합니다!")
    print("===================================")

    

def main_m() : #메인 메뉴 - while반복 처리
    print("\n")
    print("===================================")
    print("메인 메뉴 | 원하시는 기능을 선택해주세요")
    print("===================================")
    print("1. 도서관    |    대출기간,도서 확인")
    print("2. D-Day    |    중요 일정 기간 계산")
    print("3. 메모장    |    필요한 정보 기록")
    print("")
    print("4. Credit    |    만든 조원들")
    print("0. 종료    |    끝내기")
    print("===================================")

def credit() : #크레딧 출력 - 학번이름 등
    print("\n")
    print("===================================")
    print("Credit | 원하시는 기능을 선택해주세요")
    print("===================================")
    print("1. 참여 조원들    |    학번-이름") 
    print("2. 조원별 파트    |    이름-역할")
    print("")
    print("0. 종료")
    print("===================================")
            
def num_error() : #번호 선택 error - if 조건 이외
    print("===================================")
    print(" !   |   번호를 다시 입력해주세요!")
    print("===================================")
    print("\n")

def input_error() : #입력값 error - 주어진 형식 이외
    print("===================================")
    print(" !   |   값을 다시 입력해주세요!")
    print("===================================")
    print("\n")
    


def dday_m() : #D-Day 메뉴
    print("\n")
    print("===================================")
    print("D-Day | 원하시는 기능을 선택해주세요")
    print("===================================")
    print("1. 디데이 계산 - 오늘 기준")
    print("2. 디데이 계산 - 선택날짜 기준")
    print("3. 계산 기록")
    print("")
    print("0. 종료")
    print("===================================")

def dday_today() :
    print("\n")
    print("===================================")
    print("오늘 기준 계산하실 날을 입력해주세요")
    print("년 월 일 순")
    print("예 : 2022 2 22")
    print("===================================")

def dday_sel() :
    print("\n")
    print("===================================")
    print("계산하실 두 날짜를 입력해주세요")
    print("년 월 일 순")
    print("예 : 2022 2 22")
    print("===================================")

def dday_list() :
    print("\n")
    print("===================================")
    print("최근 계산하신 20건의 기록입니다")
    print("===================================")

    

def lib_m() : #도서관 메뉴
    print("\n")
    print("===================================")
    print("대출도서 관리 | 원하시는 기능을 선택해주세요")
    print("===================================")
    print("1. 도서관 운영시간")
    print("2. 대출기간 확인")
    print("3. 도서 대출")
    print("4. 도서 연장")
    print("5. 도서 반납")
    print("")
    print("0. 종료")
    print("===================================")

def lib_list() :
    print("\n")
    print("===================================")
    print("현재 대출하신 도서 리스트입니다.")
    print("===================================")

def lib_add() :
    print("\n")
    print("===================================")
    print("대출하신 도서, 일자를 입력해주세요")
    print("년 월 일 (메모) 순")
    print("예 : 2022 2 22 도서1")
    print("===================================")

def lib_add_c() :
    print("\n")
    print("===================================")
    print("도서가 대출처리 되었습니다!")
    print("===================================")

def menulib_remove() :
    print("\n")
    print("===================================")
    print("반납하실 도서의 번호를 입력해주세요")
    print("===================================")

def lib_remove_c() :
    print("\n")
    print("===================================")
    print("도서가 반납처리 되었습니다!")
    print("===================================")

def lib_time() :
    print("\n")
    print("===================================")
    print("전주대학교 도서관 운영시간")
    print("===================================")
    print("* 일반자료실 운영시간 *")
    print("학기중 - 공휴일 휴무")
    print("월 - 금 : 09:00 ~ 21:00")
    print("토요일 : 09:00 ~ 17:00")
    print("방학중 - 공휴일 휴무")
    print("월 - 금 : 09:00 ~ 17:00")
    print("토요일 : 휴실")
    print("===================================")
    print("* 자유열람실 운영시간 *")
    print("연중무휴, 시험기간 24시간 개방")
    print("매일 : 06:00 ~ 23:30 ")
    print("===================================")



def memo_m() : #메모 메뉴
    print("\n")
    print("===================================")
    print("메모 관리 | 원하시는 기능을 선택해주세요")
    print("===================================")
    print("1. 과목 보기")
    print("2. 메모 보기")
    print("3. 메모 쓰기(*경고*기존의 메모가 삭제됩니다.)")
    print("4. 과제 dday, 메모 추가")
    print("5. 메모 삭제")
    print("")
    print("0. 종료")
    print("===================================")

def memo_list() :
    print("\n")
    print("===================================")
    print("현재 저장된 메모 리스트입니다.")
    print("===================================")

def memo_write() :
    print("\n")
    print("===================================")
    print("메모를 입력해주세요")
    print("예 : MEMO")
    print("===================================")

def memo_withdday() :
    print("\n")
    print("===================================")
    print("디데이 일정을 같이 기록하실건가요? (y/n)")
    print("===================================")

def memo_add() :
    print("\n")
    print("===================================")
    print("추가하실 메모를 입력해주세요")
    print("예 : MEMO")
    print("===================================")

def memo_add_dday() :
    print("\n")
    print("===================================")
    print("추가하실 메모를 입력해주세요")
    print("년 월 일 (메모) 순")
    print("예 : 2022 2 22 MEMO(MEMO는 시작일에만 입력해주세요)")
    print("===================================")

def memo_add_c() :
    print("\n")
    print("===================================")
    print("메모가 추가 되었습니다!")
    print("===================================")

def memo_remove() :
    print("\n")
    print("===================================")
    print("삭제하실 메모의 번호를 입력해주세요")
    print("===================================")

def memo_remove_c() :
    print("\n")
    print("===================================")
    print("메모가 삭제 되었습니다!")
    print("===================================")
